In [2]:
import pandas as pd
import numpy as np
import streamlit as st
import matplotlib as plt
from pathlib import Path

In [3]:
file_path = r'C:\Users\justi\Documents\Projects\Data\Baseball_databank'

teams_path = file_path + '\Teams.csv'
salary_path = file_path + '\Salaries.csv'
batting_path = file_path + '\Batting.csv'

In [32]:
teams_df = pd.read_csv(teams_path)
teams_df = teams_df[teams_df['yearID'] >= 1985]
teams_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 888 entries, 1917 to 2804
Data columns (total 48 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   yearID          888 non-null    int64
 1   lgID            888 non-null    object
 2   teamID          888 non-null    object
 3   franchID        888 non-null    object
 4   divID           888 non-null    object
 5   Rank            888 non-null    int64
 6   G               888 non-null    int64
 7   Ghome           888 non-null    float64
 8   W               888 non-null    int64
 9   L               888 non-null    int64
 10  DivWin          860 non-null    object
 11  WCWin           624 non-null    object
 12  LgWin           860 non-null    object
 13  WSWin           860 non-null    object
 14  R               888 non-null    int64
 15  AB              888 non-null    int64
 16  H               888 non-null    int64
 17  2B              888 non-null    int64
 18  3B              888 non-null    int64
 19  HR              888 non-null    int64
 20  BB              888 non-null    int64
 21  SO              888 non-null    float64
 22  SB              888 non-null    float64
 23  CS              888 non-null    float64
 24  HBP             480 non-null    float64
 25  SF              480 non-null    float64
 26  RA              888 non-null    int64
 27  ER              888 non-null    int64
 28  ERA             888 non-null    float64
 29  CG              888 non-null    int64
 30  SHO             888 non-null    int64
 31  SV              888 non-null    int64
 32  IPouts          888 non-null    int64
 33  HA              888 non-null    int64
 34  HRA             888 non-null    int64
 35  BBA             888 non-null    int64
 36  SOA             888 non-null    int64
 37  E               888 non-null    int64
 38  DP              888 non-null    float64
 39  FP              888 non-null    float64
 40  name            888 non-null    object
 41  park            888 non-null    object
 42  attendance      888 non-null    float64
 43  BPF             888 non-null    int64
 44  PPF             888 non-null    int64
 45  teamIDBR        888 non-null    object
 46  teamIDlahman45  888 non-null    object
 47  teamIDretro     888 non-null    object
dtypes: float64(10), int64(25), object(13)
memory usage: 339.9+ KB

In [33]:
salary_df = pd.read_csv(salary_path)
salary_df = salary_df[salary_df['yearID'] >= 1985]
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25575 entries, 0 to 25574
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   yearID    25575 non-null  int64
 1   teamID    25575 non-null  object
 2   lgID      25575 non-null  object
 3   playerID  25575 non-null  object
 4   salary    25575 non-null  int64
dtypes: int64(2), object(3)
memory usage: 999.1+ KB

In [34]:
# How have salaries evolved by division over the years?
# Sum of salaries by division by year, then dig in by team

# .reset_index() converts back to a pandas dataframe, otherwise it would have been a series

team_salary_by_year_df = salary_df.groupby(['yearID','teamID','lgID'])['salary'].sum().reset_index()
team_salary_by_year_df.head()

   yearID teamID lgID    salary
0    1985    ATL   NL  14807000
1    1985    BAL   AL  11560712
2    1985    BOS   AL  10897560
3    1985    CAL   AL  14427894
4    1985    CHA   AL   9846178

In [35]:
# cool reference material for graphs here:
# https://medium.com/dataexplorations/reproducing-the-baseball-salary-visualization-from-fivethirtyeight-in-matplotlib-1af449beb409
# Lets try and recreate!

team_salary_by_year_df['salary_zscore'] = team_salary_by_year_df.groupby(['yearID'])['salary'].transform(
    lambda x: (x - x.mean()) / x.std()
)

team_salary_by_year_df.head()

   yearID teamID lgID    salary  salary_zscore
0    1985    ATL   NL  14807000       1.914905
1    1985    BAL   AL  11560712       0.601068
2    1985    BOS   AL  10897560       0.332678
3    1985    CAL   AL  14427894       1.761474
4    1985    CHA   AL   9846178      -0.092838

In [36]:
teams_df.head()

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
1917,1985,NL,ATL,ATL,W,5,162,81.0,66,96,...,197.0,0.97,Atlanta Braves,Atlanta-Fulton County Stadium,1350137.0,105,106,ATL,ATL,ATL
1918,1985,AL,BAL,BAL,E,4,161,81.0,83,78,...,168.0,0.98,Baltimore Orioles,Memorial Stadium,2132387.0,97,97,BAL,BAL,BAL
1919,1985,AL,BOS,BOS,E,5,163,81.0,81,81,...,161.0,0.97,Boston Red Sox,Fenway Park II,1786633.0,104,104,BOS,BOS,BOS
1920,1985,AL,CAL,ANA,W,2,162,79.0,90,72,...,202.0,0.98,California Angels,Anaheim Stadium,2567427.0,100,100,CAL,CAL,CAL
1921,1985,AL,CHA,CHW,W,3,163,81.0,85,77,...,152.0,0.98,Chicago White Sox,Comiskey Park,1669888.0,104,104,CHW,CHA,CHA

In [37]:
#now, lets get win rates. First step is grabbing season wins and losses from the teams table and cleaning it up
teams_df = teams_df[['yearID','lgID','teamID','G','W','L']]
teams_df = teams_df[(teams_df['yearID'] >= 1985)].reset_index().drop('index',axis=1)
teams_df.head()

   yearID lgID teamID    G   W   L
0    1985   NL    ATL  162  66  96
1    1985   AL    BAL  161  83  78
2    1985   AL    BOS  163  81  81
3    1985   AL    CAL  162  90  72
4    1985   AL    CHA  163  85  77

In [38]:
# Now that we have wins and total # games (W and G)
teams_df['win_rate'] = teams_df['W']/teams_df['G']
teams_df.head()

   yearID lgID teamID    G   W   L  win_rate
0    1985   NL    ATL  162  66  96  0.407407
1    1985   AL    BAL  161  83  78  0.515528
2    1985   AL    BOS  163  81  81  0.496933
3    1985   AL    CAL  162  90  72  0.555556
4    1985   AL    CHA  163  85  77  0.521472

In [41]:
merged_df = team_salary_by_year_df.merge(teams_df, on = ['yearID','lgID', 'teamID']).reset_index().drop('index',axis = 1)
merged_df.head()

   yearID teamID lgID    salary  salary_zscore    G   W   L  win_rate
0    1985    ATL   NL  14807000       1.914905  162  66  96  0.407407
1    1985    BAL   AL  11560712       0.601068  161  83  78  0.515528
2    1985    BOS   AL  10897560       0.332678  163  81  81  0.496933
3    1985    CAL   AL  14427894       1.761474  162  90  72  0.555556
4    1985    CHA   AL   9846178      -0.092838  163  85  77  0.521472